# To install the dependencies listed in this file, install Homebrew and run `brew bundle`.

brew 'alexjs'
brew 'bash'
brew 'binutils'
brew 'ccache'
brew 'checkbashisms'
brew 'cmake'
brew 'coreutils'
brew 'cppcheck'
brew 'docbook'
brew 'docbook-xsl'
brew 'doxygen'
brew 'fdupes'
brew 'flawfinder'
brew 'gcovr'
brew 'ghostscript'
brew 'glfw'
brew 'grep'
brew 'jpeginfo'
brew 'jq'
brew 'infer'
brew 'mandoc'
brew 'moreutils'
brew 'mypy'
brew 'Brew/check-all-the-things.rb'
brew 'Brew/nsiqcppstyle.rb'
brew 'pandoc'
brew 'Brew/pdf-link-checker.rb'
brew 'p7zip'
brew 'pcre'
brew 'pngcheck'

# https://raw.githubusercontent.com/Homebrew/homebrew-core/7f15f6dc08e8e7e0629de0fcc009c40a6761d483/Formula/pngquant.rb
# This is the latest version of pngquant that's packaged for Mac OS 10.10.
brew 'Brew/pngquant.rb', force_bottle: true

brew 'proselint'
brew 'pycodestyle'
brew 'python'
brew 'shellcheck'
brew 'tidy-html5'
brew 'translate-toolkit'
brew 'xmlstarlet'
brew 'xz'
brew 'yamllint'

cask 'oclint'
cask 'oracle-jdk'

tap 'smokris/getwindowid'
brew 'getwindowid'
